"""
Реализуйте декоратор square, который возводит возвращаемое значение декорируемой функции во вторую степень.
Также декоратор должен сохранять имя и строку документации декорируемой функции
Примечание 1. Гарантируется, что возвращаемым значением декорируемой функции является объект типа int или float.
Примечание 2. Не забывайте про то, что декоратор не должен поглощать возвращаемое значение декорируемой функции,
а также должен уметь декорировать функции с произвольным количеством позиционных и именованных аргументо
"""
import functools


def square(func):
    @functools.wraps(func)
    def wrapper(*args, **kwargs):
        result = func(*args, **kwargs)
        return result ** 2

    return wrapper


@square
def add(a, b):
    """прекрасная функция"""
    return a + b


print(add(1, 1))
print(add.__name__)
print(add.__doc__)
