"""
Анри и Дима, имея на руках ящик с бесконечным количеством носков, решили сыграть в игру. Ребята по очереди достают из
ящика произвольное количество носков, и после неопределенного числа ходов игра заканчивается. Если тот, кто сделал
последний ход, вытащил четное количество носков — он побеждает, в противном случае проигрывает.
Напишите программу, которая определяет победителя в данной игре, если первый ход делает Анри.
"""

import sys

data = [int(line.strip()) for line in sys.stdin]

if (len(data) % 2 == 0 and data[len(data) - 1] % 2 == 0) or (len(data) % 2 != 0 and data[len(data) - 1] % 2 != 0):
    print('Дима')
else:
    print('Анри')
